ONVIF-SIM/fakecamera/dis.xml

<?xml version="1.0" encoding="UTF-8"?><s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl"><s:Header><a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</a:Action><a:MessageID>04bd6539-3b2e-45ad-88c9-13b6cdf63db1</a:MessageID><a:RelatesTo>uuid:8c199587-23c5-4781-83ae-f9038ac28503</a:RelatesTo><a:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:To></s:Header><s:Body><d:ProbeMatches><d:ProbeMatch><a:EndpointReference><a:Address>urn:uuid:4d5ea2de-75e3-495e-8d5f-51c4c0cfdd12</a:Address></a:EndpointReference><d:Types>dn:NetworkVideoTransmitter</d:Types><d:Scopes>onvif://www.onvif.org/name/Videonetics_Camera_Emulator onvif://www.onvif.org/manufacturer/VideoneticsAPL onvif://www.onvif.org/hardware/Videonetics_Management_System onvif://www.onvif.org/location/Any onvif://www.onvif.org/type/video_encoder</d:Scopes><d:XAddrs>http://172.16.4.9:7000/onvif/device_service</d:XAddrs><d:MetadataVersion>1</d:MetadataVersion></d:ProbeMatch></d:ProbeMatches></s:Body></s:Envelope>